tap "homebrew/science"
tap "homebrew/core"
tap "homebrew/python"
tap "homebrew/bundle"
tap "sanemat/font"
tap "caskroom/cask"
tap "argon/mas"
tap "rcmdnk/file"
tap "neovim/neovim"
cask "xquartz"
brew "autoconf"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "libffi"
brew "pixman"
brew "cmake"
brew "ctags"
brew "czmq"
brew "dcraw"
brew "eigen"
brew "fish"
brew "icu4c"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "gmp"
brew "libmpc"
brew "gcc"
brew "git"
brew "openssl"
brew "pkg-config"
brew "readline"
brew "ilmbase"
brew "libsodium"
brew "little-cms"
brew "lua"
brew "python"
brew "macvim"
brew "neovim"
brew "numpy"
brew "open-jtalk"
brew "openexr"
brew "opencv"
brew "pandoc"
brew "peco"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "the_silver_searcher"
brew "tree"
brew "ufraw"
brew "vim", args: ["with-lua"]
brew "zbar"
brew "zsh"
brew "zsh-completions"
brew "argon/mas/mas"
brew "rcmdnk/file/brew-file"
brew "sanemat/font/ricty"
cask "atom"
cask "iterm2"
cask "karabiner-elements"
cask "vagrant"
cask "virtualbox"
mas "CheatSheet", id: 529456740
mas "CloudClip Manager", id: 563362017
mas "ColorQuest", id: 807814068
mas "Disk Diag", id: 672206759
mas "ExifPurge", id: 784466108
mas "Face4Pass", id: 554503804
mas "ForkLift", id: 412448059
mas "iBoostUp", id: 484829041
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LanScan", id: 472226235
mas "MarkPy", id: 1139055360
mas "MemoryKeeper", id: 689992800
mas "Microsoft Remote Desktop", id: 715768417
mas "MouseX", id: 571478381
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pingo HD", id: 531817541
mas "Pocket", id: 568494494
mas "QR Journal", id: 483820530
mas "Shazam", id: 897118787
mas "Skitch", id: 425955336
mas "System Lens", id: 484868989
mas "The Unarchiver", id: 425424353
mas "Tweetbot", id: 557168941
mas "Wimoweh", id: 610341008
mas "Wireless Signal", id: 582840059
mas "Xcode", id: 497799835
