scriptencoding utf-8
" Created:     2019/11/20 14:16:20
" Last Change: 2019/11/20 14:17:45.

" ---------------------------------------------------------------------------
" マップキー
" ---------------------------------------------------------------------------
" <Leader>m: over.vim 起動
nnoremap <silent> <Leader>m :OverCommandLine<CR>

" ---------------------------------------------------------------------------
" 基本設定
" ---------------------------------------------------------------------------
" カーソル下の単語をハイライト付きで置換
nnoremap sub :OverCommandLine<CR>%s/<C-r><C-w>//g<Left><Left>

" コピーした文字列をハイライト付きで置換
nnoremap subp y:OverCommandLine<CR>%s!<C-r>=substitute(@0, '!', '\\!', 'g')<CR>!!gI<Left><Left><Left>
