scriptencoding utf-8
" Created:     201*/**/** **:**:**
" Last Change: 2019/11/21 14:58:29.

" ------------------------------------------------------------------------------
"  マップキー
" ------------------------------------------------------------------------------
" ,t: "TagList" を開く
" nnoremap <silent> ,t :TlistOpen<CR>
nnoremap <leader>,t :TlistOpen<CR>

" ------------------------------------------------------------------------------
"  基本設定
" ------------------------------------------------------------------------------
let Tlist_Exit_OnlyWindow  = 1
let Tlist_Show_One_File    = 1
let Tlist_Use_Right_Window = 1
