scriptencoding utf-8
" Created:     2016/10/09 21:28:05
" Last Change: 2023/03/12 08:21:12.

" ------------------------------------------------------------------------------
"  マップキー
" ------------------------------------------------------------------------------
" スクリプトを実行
nnoremap <F5> :<C-u>w <ENTER> :!% <ENTER>

" ------------------------------------------------------------------------------
"  基本設定
" ------------------------------------------------------------------------------
set encoding=utf-8
set fileformat=dos
set fileformats=dos,unix,mac
set fileencoding=sjis
set fileencodings=sjis,iso-2022-jp,euc-jp,utf-8
