scriptencoding utf-8
" Created:     2016/10/09 21:28:05
" Last Change: 2019/11/22 11:14:42.

" -----------------------------------------------------------------------------
"  マップキー
" -----------------------------------------------------------------------------
" スクリプトを実行
nnoremap <F5> :w <ENTER> :!% <ENTER>

" -----------------------------------------------------------------------------
"  基本設定
" -----------------------------------------------------------------------------
set encoding=utf-8
set fileformat=dos
set fileformats=dos,unix,mac
set fileencoding=sjis
set fileencodings=sjis,iso-2022-jp,euc-jp,utf-8
